src/cf/Catalogs/desНастройкиДействийПриОбмене.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>desНастройкиДействийПриОбмене</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбщихПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстанавливатьОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторнаяОтправка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.desВариантыНастроекОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.desДействияПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпечатокОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>44</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтпечатокПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>44</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗадание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОбработка</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеСхемаИсточникаДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКомпоновщикНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеПараметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЗначенияПоУмолчанию</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлятьПоЭлектроннойПочте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПолучателяУведомления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/desОбменДаннымиПовтИсп/Ext/Module.bsl
Функция ПодключитьОбработкуДействияПоОтпечатку(ОтпечатокОбработки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	desНастройкиДействийПриОбменеДействия.ХранилищеОбработка
		|ИЗ
		|	Справочник.desНастройкиДействийПриОбмене.Действия КАК desНастройкиДействийПриОбменеДействия
		|ГДЕ
		|	desНастройкиДействийПриОбменеДействия.ОтпечатокОбработки = &ОтпечатокОбработки";
	
	Запрос.УстановитьПараметр("ОтпечатокОбработки", ОтпечатокОбработки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбработкаОбменаДанными = Неопределено;	
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ДанныеОбработки	= ВыборкаДетальныеЗаписи.ХранилищеОбработка.Получить();
		
		Если ДанныеОбработки <> Неопределено Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".epf");
			ДанныеОбработки.Записать(ИмяВременногоФайла);
			Попытка
				ОбработкаОбменаДанными = ВнешниеОбработки.Создать(ИмяВременногоФайла, Ложь);
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбработкаОбменаДанными;
	
КонецФункции

Функция ПолучитьОбработкуДействия(Организация,Контрагент,ДействиеОбмена) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	desНастройкиДействийПриОбменеДействия.ОтпечатокОбработки,
	|	1 КАК Приоритет
	|ИЗ
	|	Справочник.desНастройкиДействийПриОбмене.Действия КАК desНастройкиДействийПриОбменеДействия
	|ГДЕ
	|	desНастройкиДействийПриОбменеДействия.Ссылка.Организация = &Организация
	|	И desНастройкиДействийПриОбменеДействия.Ссылка.Контрагент = &Контрагент
	|	И desНастройкиДействийПриОбменеДействия.Действие = &Действие
	|	И НЕ desНастройкиДействийПриОбменеДействия.Ссылка.ПометкаУдаления
	|	И desНастройкиДействийПриОбменеДействия.Включено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	desНастройкиДействийПриОбменеДействия.ОтпечатокОбработки,
	|	2
	|ИЗ
	|	Справочник.desНастройкиДействийПриОбмене.Действия КАК desНастройкиДействийПриОбменеДействия
	|ГДЕ
	|	desНастройкиДействийПриОбменеДействия.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И desНастройкиДействийПриОбменеДействия.Ссылка.Контрагент = &Контрагент
	|	И desНастройкиДействийПриОбменеДействия.Действие = &Действие
	|	И НЕ desНастройкиДействийПриОбменеДействия.Ссылка.ПометкаУдаления
	|	И desНастройкиДействийПриОбменеДействия.Включено
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("Действие"   , ДействиеОбмена);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент" , Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат desОбменДаннымиПовтИсп.ПодключитьОбработкуДействияПоОтпечатку(ВыборкаДетальныеЗаписи.ОтпечатокОбработки);
	КонецЕсли;
	
КонецФункции
